Repository: mozilla-l10n/mt-training-data
Catalog: mg/mg_pontoon.tmx
Source language: en_us
Languages: mg

source: Monthly Active Contributors
mg: Mpandray Anjara Mavitrika Isam-bolana

source: More system details
mg: Antsipirian'ny rafitra bebe kokoa

source: More than
mg: Mihoatra ny

source: More than one level 2 review change drops the localization to 0%
mg: Ny fanovana fitsarana mihoatra ny ambaratonga 2 dia mampihena ny fandikanteny ho 0%

source: Most Recent
mg: Vao Haingana Indrindra

source: Most Viewed
mg: Be Mpijery Indrindra

source: Most Visited
mg: Be Mpitsidika Indrindra

source: Mozilla Support
mg: Fanampiana Mozilla

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe.
mg: Fanampiana Mozilla dia vondrona mpilatsaka an-tsirapo sy mpiasa mavitrika miezaka manampy ireo mpampiasanay manerana ny tany.

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe. Join us for an incredible adventure!
mg: Fanampiana Mozilla dia vondrona mpilatsaka an-tsitrapo sy mpiasa mavitrika miezaka manampy ireo mpampiasanay manerana ny tany. Avia ho namanay hanao dia kisendrasendra tsy mampino!

source: Mozilla support is fully powered by our volunteer community that is helping hundreds of users everyday. This community is formed by passionate Firefox and Thunderbird users who take some of their spare time to help others. We couldn't do it without your passion and enthusiasm. Your contribution, as minor as it might seem, has tremendous value. Solving one issue in the support forums can help up to 1000 users a day!
mg: Ny fanampiana Mozilla dia vokarin'ny vondrona mpilatsaka an-tsitrapo izay manampy mpampiasa an-jatony isan'andro. Ny mandrafitra an'io vondron'olona io dia mpampiasa Firefox sy Thunderbird mafana fo izay maka @ fotoana malalaka ananany hanampiany ny hafa. Tsy ho nahavita an'io izahay raha tsy nisy ny hafanam-ponareo sy ny havitrihanareo. Ny fandraisana anjara, na dia bitika tahaka ny inona aza, dia manan-danja izaitsizy. Ny famahana olana iray ao @ ireo fihaonambe fanampiana dia mety hanampy mpampiasa mahatratra 1000 isan'andro!

source: Mozillians Username
mg: Solonanarana Mozillianina

source: Multiple Products
mg: Vokatra Maromaro

source: Music, Photos and Video
mg: Mozika, Sary ary Horonantsary

source: My contributions
mg: Fandraisako anjara

source: My password isn't working.
mg: Tsy mandeha ny tenimiafiko.

source: My profile
mg: Ny mombamomba ahy

source: My Questions
mg: Ireo Fanontaniako

source: {name} {version} ({id}) (Inactive)
mg: {name} {version} ({id}) (Tsy miasa)

source: Navigation
mg: Fitetezana

source: Need Changes
mg: Mila Fanovana

source: needs attention
mg: mila firaharahana

source: Needs change
mg: Mila fanovana

source: Needs change:
mg: Mila fanovana:

source: Needs info
mg: Mila fampahalalana

source: Needs more information
mg: Mila fampahalalana bebe kokoa

source: Needs Update
mg: Mila Fanavaozana

source: New announcement for {group}
mg: Fampandrenesana vaovao ho an'ny {group}

source: New answers for question: %s
mg: Valiny vaovao ho an'ny fanontaniana: %s

source: New Article
mg: Lahatsoratra Vaovao

source: Newer
mg: Vaovao kokoa

source: New Message
mg: Hafatra Vaovao

source: New password
mg: Tenimiafina vaovao

source: New password:
mg: Tenimiafina vaovao:

source: New Password
mg: Tenimiafina Vaovao

source: New Password Again
mg: Tenimiafina Vaovao Indray

source: News &amp; Resources
mg: Vaovao &amp; Loharano

source: News Feeds (RSS), Blogs and Social
mg: Faham-baovao (RSS), Bilaogy ary Fiarahamonina

source: New thread: {title}
mg: Resaka mitohy vaovao: {title}

source: next
mg: manaraka

source: No
mg: Tsia

source: No differences found
mg: Tsisy fahasamihafana hita

source: No, ignore
mg: Tsia, aza raharahaina

source: No, I'm not.
mg: Tsia, tsy misoratra ao aho.

source: No media files found.
mg: Tsisy rakitra haino&jery hita.

source: No messages selected. Please try again.
mg: Tsisy hafatra voafantina. Andramo indray azafady.

source: None
mg: Tsy misy

source: non en-US KB
mg: MB tsy en-US

source: None of these solve my problem
mg: Tsy nisy namaha ny olako ireo

source: No one has helped translate this article yet. If you already know how localizing for SUMO works, <a href="%(document_trans_link)s">start translating now</a>. If you want to learn how to translate articles for SUMO, <a href="%(help_link)s">please start here</a>.
mg: Tsy mbola nisy olona nanampy t@ fandikana an'ity lahatsoratra ity. Raha efa fantatrao ny fandehan'ny fandikanteny ho an'i SUMO, dia <a href="%(document_trans_link)s">manomboha mandika izao</a>. Raha te-hianatra ny fomba fandikana lahatsoratra ho an'i SUMO ianao, dia <a href="%(help_link)s">manomboha eto azafady</a>.

source: No other documents link to {title}.
mg: Tsisy tahirin-kevitra hafa mifandrohy @ {title}.

source: No pages matched the search criteria
mg: Tsisy pejy mifanandrify amin'ilay fepetra fikarohana

source: No related documents.
mg: Tsisy tahirin-kevitra sahala.

source: No replies
mg: Tsisy valiny

source: No results found.
mg: Tsisy vokany hita.

source: No sections found
mg: Tsisy fizarana hita

source: No Surprises
mg: Tsisy ny Tampoka

source: No tags entered.
mg: Tsisy tagy nampidirina.

source: Note: Searching for "tag1, tag2" returns questions tagged with both tag1 and tag2
mg: Fanamarihana: ny fikarohana ny "tagy1, tagy2" dia mamoaka fanontaniana voamarika @ tagy1 sy tagy2

source: Note: There are no approved translations for this article.
mg: Fanamarihana: tsy manana dikanteny nankatoavina ity lahatsoratra ity.

source: Note: This article has no revisions ready for localization.
mg: Fanamarihana: tsy manana fanitsiana vonona hadika ity lahatsoratra ity.

source: No Thanks
mg: Tsia fa misaotra

source: Not Helpful
mg: Tsy Manampy

source: Notify me of any future changes to this page
mg: Ilazao aho rehefa misy fanovana an'ity pejy ity @ manaraka

source: No title
mg: Tsisy lohateny

source: Not responded in 24 hours
mg: Tsy namaly tao anatin'ny 24 ora

source: Not responded in 72 hours
mg: Tsy namaly tao anatin'ny 72 ora

source: Not sure how often
mg: Tsy azo antoka ny hatetiny

source: No users selected!
mg: Tsisy mpampiasa voafantina!

source: No users were found for your search query.
mg: Tsisy mpampiasa hita misy ilay teny fikarohanao.

source: No votes data
mg: Tsisy datan'ny latsa-bato

source: Now you can combine both and help Firefox users on Twitter. It's quick, it's easy, and you don't have to be a tech superstar to do it. We call it our Army of Awesome.
mg: Azonao atao izao ny manambatra azy roa sy manampy ireo mpampiasa Firefox ao @ Twitter. Haingana izany, mora izany, ary na tsy tampom-pahaizana @ haitao ianao vao mahavita azy. Io no antsoinay hoe Tafiky ny Mahagaga.

source: {num} answers
mg: Valiny {num}

source: %(number)d day ago
mg: %(number)d andro lasa

source: %(number)d hour ago
mg: %(number)d ora lasa

source: %(number)d minute ago
mg: %(number)d minitra lasa

source: %(number)d month ago
mg: %(number)d volana lasa

source: %(number)d second ago
mg: %(number)d segondra lasa

source: %(number)d week ago
mg: %(number)d herinandro lasa

source: %(number)d year ago
mg: %(number)d taona lasa

source: Numbered List
mg: Lisitra ilaharana

source: Numbered list item
mg: Singan'ny lisitra ilaharana

source: Number of active Army of Awesome contributors
mg: Isan'ny mpandray anjara mavitrika @ Tafiky ny Mahagaga

source: Number of active contributors to the English KB
mg: Isan'ny mpandray anjara mavitrika ao @ TP Anglisy

source: Number of active contributors to the non-English KB
mg: Isan'ny mpandray anjara mavitrika ao @ TP tsy Anglisy

source: Number of active forum contributors
mg: Isan'ny mpandray anjara mavitrika @ fihaonambe

source: Number of answers
mg: Isan'ny valiny

source: Number of Answers
mg: Isan'ny Valiny

source: Number of replies
mg: Isan'ny valiny

source: Number of Replies
mg: Isan'ny Valiny

source: Number of votes. Must be an integer.
mg: Isan'ny vato. Tsy maintsy isa tsimivaky.

source: %(numerator)s of %(denominator)s
mg: %(numerator)s @ %(denominator)s

source: %(numerator)s <small>of %(denominator)s</small>
mg: %(numerator)s <small>@ %(denominator)s</small>

source: {num} solutions
mg: Vahaolana {num}

source: %(num)s <small>of %(total)s</small>
mg: %(num)s <small>@ %(total)s</small>

source: {num_views} views
mg: Jery {num_views}

source: Object does not exist.
mg: Zavatra tsy misy.

source: Obsolete:
mg: Tranainy:

source: Official blog
mg: Bilaogy ofisialy

source: Oh, no! It looks like an unexpected error occurred. We've already notified the site administrators. Please try again now, or in a few minutes.
mg: Andray! Toa nisy olana tsy nampoizina. Efa nilazanay ireo mpandrindra tranonkala. Andramo indray izao, na afaka minitra vitsivitsy, azafady.

source: Oh, no! Looks like there are no posts!
mg: Andray! Toa tsisy petadrindrina!

source: Older
mg: Tranainy kokoa

source: Old Password
mg: Tenimiafina Taloha

source: %(old)s-redirect-%(number)i
mg: %(old)s-familiana-%(number)i

source: %(old)s Redirect %(number)i
mg: %(old)s Familiana %(number)i

source: Once you’ve clicked on the link, you can throw away this email.
mg: Rehefa avy nanindry ilay rohy ianao, dia afaka manary ity mailaka ity.

source: Only displayed on search results page
mg: Aseho @ pejin'ny voka-pikarohana ihany

source: Only use and share information about our users for their benefit and as disclosed in our notices.
mg: Aza mampiasa na mizara fampahalalana momba ireo mpampiasa raha tsy ho an'ny tombontsoany sy araka ny avoaka @ filazanay ihany.

source: Oops, there was an error.
mg: Oy, nisy olana.

source: Oops, your request was unsuccessful
mg: Oy, tsy nahomby ny fangatahanao

source: Open <em>Help &gt; Troubleshooting Information</em>.
mg: Sokafy <em>Fanampiana &gt; Fampahalalana Famahana Olana</em>.

source: Operating system
mg: Rafitra fikirakirana

source: Original post date
mg: Datin'ny petadrindrina nifotorana

source: Other
mg: Hafa

source: Other Mozilla products
mg: Vokatra Mozilla hafa

source: Other (please specify)
mg: Hafa (farito mazava azafady)

source: Other products
mg: Vokatra hafa

source: Other questions with Firefox for Windows 8 Touch.
mg: Fanontaniana hafa momba an'i Firefox ho an'i Windows 8 Touch.

source: Other reason:
mg: Antony hafa:

source: Other ways to get involved
mg: Fomba hafa handraisana anjara

source: Our contributors have been working hard on articles and it would be great if you could review them. The faster we get them published the faster they start helping users.
mg: Niasa mafy ireo mpandray anjara nanao ireo lahatsoratra ary hankasitrahana tokoa raha mba afaka mitsara azy ireo ianao. Raha haingana ny famoahana azy ireo dia ho haingana koa ny fanombohany manampy ireo mpampiasa.

source: Our volunteers are working on translating this article. Until it's ready, maybe the English version can be of some help.
mg: Miasa @ fandikana an'ity lahatsoratra ity ireo mpilatsaka an-tsitrapontsika. Mandra-pahavonony, dia angamba mety hanampy ilay kinova @ teny Anglisy.

source: Overall
mg: Faobe

source: Overview
mg: Ambangovangony

source: owner
mg: tompony

source: Page {0} of {1}.
mg: Pejy {0} @ {1}.

source: Page does not exist.
mg: Pejy tsy misy.

source: Page {n}
mg: Pejy {n}

source: Page Not Found
mg: Pejy Tsy Hita

source: Password
mg: Tenimiafina

source: Password:
mg: Tenimiafina:

source: Password change successful!
mg: Vita soa aman-tsara ny fanovana tenimiafina!

source: Password is required.
mg: Ilaina ny tenimiafina.

source: Password must be 8 or more characters.
mg: Tsy maintsy maritsoratra 8 na mihoatra ny tenimiafina.

source: Password reset
mg: Famerenam-panefena tenimiafina

source: Password Reset
mg: Hanefy Tenimiafina Indray

source: Password reset on {sitename}
mg: Famerenam-panefena tenimiafina ao @ {sitename}

source: Password reset unsuccessful
mg: Tsy nety ny famerenam-panefena tenimiafina

source: Passwords, forms and search
mg: Tenimiafina, takelaka fenoina sy fikarohana

source: Passwords, forms, search, and history - control what Firefox suggests
mg: Tenimiafina, takelaka fenoina, fikarohana ary tantara, fero ny sosokevitra omen'i Firefox

source: Password should be at least 8 characters long and contain at least 1 number.
mg: Ny tenimiafina dia tokony ho maritsoratra 8 ny halavany farafahakeliny ary misy isa 1 farafahakeliny.

source: Password successfully reset.
mg: Vita soa aman-tsara ny fanefena indray ny tenimiafina.

source: Paste the info in the text box below.
mg: Apetaho @ boatin-tsoratra eto ambany ilay fampahalalana.

source: Payment Issues
mg: Olana momba ny Fandoavam-bola

source: Payments
mg: Fandoavam-bola

source: Payments/Settlement
mg: Fandoavam-bola/Settlement

source: Pending
mg: Miandry

source: Percent
mg: Salanisa

source: Percent Localized: All
mg: Isan-jato Voadika: Rehetra

source: Percent Localized: Top 100
mg: Isan-jato Voadika: 100 Voalohany

source: Percent Localized: Top 20
mg: Isan-jato Voadika: 20 Voalohany

source: Percent Yes
mg: Salanisa Eny

source: Pick a product
mg: Hifidy vokatra

source: Pick a topic and try some solutions
mg: Hifidy lohahevitra ary hanandrana vahaolana vitsivitsy

source: Pick a way to get involved
mg: Mifidiana fomba iray handraisana anjara

source: Please ask a new question if you need help.
mg: Mametraha fanontaniana azafady raha mila fanampiana.

source: Please check you are logged in, and try again.
mg: Zahao raha tafiditra ianao azafady, ary andramo indray.

source: Please choose a category.
mg: Mifidiana sokajy azafady.

source: Please complete the form below to submit your question to our Marketplace Support group.
mg: Fenoy azafady ny takelaka eto ambany raha handefa ny fanontanianao @ vondrona Fanohanana momba ny Tsena.

source: Please confirm your email address
mg: Hamafiso ny adiresy mailakao azafady

source: Please confirm your email address.
mg: Hamafiso ny adiresy mailakao azafady.

source: Please Confirm Your Email Address
mg: Hamafiso ny Adiresy Mailakao Azafady

source: Please confirm your Firefox Help question
mg: Hamafiso ny fanontanianao Fanampiana Firefox azafady

source: Please describe your issue in the body.
mg: Soritsorito ao @ vatan-kafatra ny olanao azafady.

source: Please enter a correct username and password. Note that both fields are case-sensitive.
mg: Mampidira solonanarana sy tenimiafina azafady. Mariho fa samy mora tohina @ haventy/hadiniky ny soratra ireo saha roa.

source: Please enter a facebook.com URL.
mg: Mampidira URL facebook.com iray azafady.

source: Please enter your password twice.
mg: Ampidiro indroa ny tenimiafinao azafady.

source: Please keep the length of the body content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny atin'ny vatan-kafatra azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of the comment to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny fanehoan-kevitra azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of the content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny atiny azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of the slug to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny rambon'adiresy azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of the subject to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny antony azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of the summary to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny famintinana azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of the title to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny lohateny azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of your content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny atiny azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of your description to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny fanoritsoritanao azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of your image filename to %(max)s characters or less. It is currently %(length)s characters.
mg: Tano ho maritsoratra %(max)s na latsaka ny halavan'ny anaran'ny raki-tsarinao azafady. Maritsoratra %(length)s izy izao.

source: Please keep the length of your message to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny hafatrao azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of your question to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny fanontanianao azafady. Maritsoratra %(show_value)s izy izao.

source: Please keep the length of your title to %(limit_value)s characters or less. It is currently %(show_value)s characters.
mg: Tano ho maritsoratra %(limit_value)s na latsaka ny halavan'ny lohateninao azafady. Maritsoratra %(show_value)s izy izao.

source: Please note that these selections are specific to the current product selected.
mg: Mariho azafady fa ireto fantina ireto dia toetra manokan'ilay vokatra voafantina ankehitriny.

source: Please note that you will be subscribed to these notifications for all products. If you are only interested in specific products, please go to the dashboard for that product.
mg: Mariho azafady fa hisoratra @ ireto filazana ireto ho an'ny vokatra rehetra ianao. Raha vokatra miavaka manokana no mahaliana anao, dia mandehana ao @ takelaka fanamoriana an'ilay vokatra azafady.

source: Please provide a description.
mg: Asio fanoritsoritana azafady.

source: Please provide a message.
mg: Asio hafatra azafady.

source: Please provide an email.
mg: Asio mailaka azafady.

source: Please provide an email address and we'll send you an alert.
mg: Manomeza adiresy mailaka azafady ary handefasanay fanairana ianao.

source: Please provide a question.
mg: Asio fanontaniana azafady.

source: Please provide a slug.
mg: Asio rambon'adiresy azafady.

source: Please provide a subject.
mg: Asio antony azafady.

source: Please provide a summary.
mg: Asio famintinana azafady.

source: Please provide a tag.
mg: Asio tagy azafady.

source: Please provide a title.
mg: Asio lohateny azafady.

source: Please provide content.
mg: Asio atiny azafady.

source: Please provide more details
mg: Manomeza antsipiriany misimisy azafady

source: Please provide the Transaction ID.
mg: Omeo ny ID an'ny Fifanakalozana azafady.

source: Please review the latest revision.
mg: Tsarao ilay fanitsiana farany indrindra azafady.

source: Please review the latest version.
mg: Tsarao ilay kinova farany indrindra azafady.

source: Please select...
mg: Azafady mifatena…

source: Please select a category from the previous column or start a search.
mg: Mifantena sokajy ao @ tsanganana eo aloha na manomboha fikarohana azafady.

source: Please select a different title.
mg: Mifantena lohateny hafa azafady.

source: Please select an image or video to insert.
mg: Mifantena sary na horonantsary hatsofoka azafady.

source: Please select at least one product.
mg: Azafady mifantena vokatra iray farafahakeliny.

source: Please select at least one topic.
mg: Azafady mifantena lohahevitra iray farafahakeliny.

source: Please type in your username to confirm
mg: Soraty azafady ny solonanaranao hanamafisana azy

source: Please upload an image with one of the following extensions: jpg, jpeg, png, gif.
mg: Azafady mampiakara sary mitondra ireto fanitarana manaraka ireto: jpg, jpeg, png, gif.

source: Please visit the <a href="https://www.paypal.com/cgi-bin/helpweb?cmd=_help"> Paypal Help Center</a>.
mg: Tsidiho azafady ny <a href="https://www.paypal.com/cgi-bin/helpweb?cmd=_help"> Foibe Fanampian'i Paypal</a>.

source: Please visit the Marketplace page for the application. There you can find the developers' contact information and contact them directly.
mg: Tsidiho azafady ny pejy Tsena ho an'ilay rindranasa. Ao no hahitanao ny fomba ifandraisana @ mpamolavola sy afahanao mifandray mivantana amin'izy ireo.

source: Please wait...
mg: Andraso azafady…

source: Popular articles
mg: Lahatsoratra malaza

source: Popular tips and solutions for Firefox for Android
mg: Fika sy vahaolana malaza ho an'i Firefox ho an'i Android

source: Portions of this content are &copy;1998–2015 <br>by individual mozilla.org contributors. Content <br>available under a <a href="//www.mozilla.org/foundation/licensing/website-content.html">Creative Commons license</a>.
mg: Ireo sombin'ity atiny ity dia &copy;1998–2015 <br>nataon'ireo mpandray anjara tsirairay ao @ mozilla.org. Atiny <br>azo ampiasaina araka ny <a href="//www.mozilla.org/foundation/licensing/website-content.html">fahazoan-dàlana Creative Commons</a>.

source: post
mg: petadrindrina

source: Post a new thread
mg: Hametaka resaka mitohy vaovao

source: Post a question
mg: Hametaka fanontaniana

source: Post a reply
mg: Hametaka valiny

source: Post a Reply
mg: Hametaka Valiny

source: Post contains
mg: Petadrindrina misy

source: Posted
mg: Napetaka

source: posted by
mg: napetak'i

source: Post Preview:
mg: Topy Maso Petadrindrina:

source: Post Question
mg: Hametaka Fanontaniana

source: Post Reply
mg: Hametaka Valiny

source: Posts from everyone
mg: Petadrindrina avy @ tsirairay

source: Post Thread
mg: Hametaka Resaka Mitohy

source: Preferred language
mg: Teny tiana

source: Preview
mg: Hanopy maso

source: Preview Changes
mg: Hanopy Maso Fanovana

source: Preview Content
mg: Hanopy Maso Atiny

source: Preview Reply
mg: Hanopy Maso Valiny

source: previous
mg: teo aloha

source: Privacy
mg: Tsiambaratelo

source: Privacy and security
mg: Tsiambaratelo sy fiarovana

source: Privacy and Security
mg: Tsiambaratelo sy Fiarovana

source: Privacy and security settings
mg: Tefin'ny tsiambaratelo sy fiarovana

source: Private message
mg: Hafatra tsiambaratelo

source: Private Message
mg: Hafatra Tsiambaratelo

source: Problems with add-ons, plugins or unwanted software
mg: Olana momba ireo fanampy, fanohy na rindrambaiko tsy nirina

source: Problems with websites
mg: Olana @ tranonkala

source: Problems with websites that don't work well in Firefox for Windows 8 Touch.
mg: Olana @ tranonkala izay tsy mandeha tsara @ Firefox ho an'i Windows 8 Touch.

source: Procedures to diagnose and fix problems
mg: Fomba fampiasa hamantarana sy hahamana olana

source: Product
mg: Vokatra

source: {product} Help
mg: Fanampiana {product}

source: [{product}] Knowledge Base Dashboard
mg: Takelaka Fanamoriana Tobim-pahalalana [{product}]

source: Products
mg: Vokatra

source: {product} Support Forum
mg: Fihaonambe Fanampiana {product}

source: Profile
mg: Mombamomba

source: Progress
mg: Fandroso

source: Protect your information with Firefox's privacy settings on iOS
mg: Arovy @ alàlan'ireo tefin-tsiambaratelon'i Firefox ireo fampahalalanao ao @ iOS
